[
    {
        "date":"16.02.2024", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Vyhodnotenie aktuálneho stavu projektu a plánovanie práce na letný semester.",
            "Dokumentácia : prehodnotiť obsah a zhrnúť ho do kľúčovejších bodov, kontrola poradia kontentu tak, aby všetko na seba nadväzovalo chronologicky, pri každom testovaní zaznamenávať výsledky úspešnosti (buď separátne alebo ako tabuľku zhrnutia všetkých výsledkov).",
            "Do budúceho stretnutia naštudovať dostupné metriky zaoberajúce sa viac triednou segmentáciou (kľudne aj iných problémov ako očnej sietnice) - Dice, Average Recall, ...",
            "Rozdelenie praktickej časti na 3 experimenty :",
            "1. Všetky pixely (bez augmentácie) - spozorovali sme problém s maskami, konkrétne so zahnutou časťou vrstiev, tu vykonáme experiment s pôvodnou veľkosťou, ktorá zahŕňa danú časť a aj experiment, pri ktorom orežeme obrázky tak, aby sa zahnutá časť na nich nenachádzala.",
            "2. Po vrstvách - tu už pracujeme s orezanými obrázkami (bez zakryvenej časti), vykonáme experiment s augmentáciou a bez augmentácie a posúdime, ktorý je lepší. Následne môžeme experimentovať s augmentáciou aj na inej sieti.",
            "3. Náhodná celá makula - pokúsime sa nájsť normálnu makulu ideálne aj s maskou a otestovať na nej náš program."
        ]
    },{
        "date":"23.02.2024", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Prezentácia nájdených metrík -> zvolili sme si metriku Dice score.",
            "Naplánovanie budúceho stretnutia na 01.03.2024 o 11:45.",
            "Do budúcna natrénovať orezanú sieť bez zahnutej časti.",
            "Použiť augmentáciu a porovnať výsledky s predošlými testovaniami (doterajšia najlepšia úspešnosť 79% na neorezanom)."
        ]
    },{
        "date":"01.03.2024", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Odprezentovanie implementácie Dice score a ukážka jeho výpočtu.",
            "Vyhodnotenie jednej netrénovanej siete pomocou Dice score a zdieľanie našich výsledkov.",
            "Diskusia o úspešnosti trénovania, porovnanie úspešnosti s prácami iných ľudí.",
            "Do najbližšieho stretnutia naplánovať rozdelenie trénovania rôznych sietí, na ktorých bude už aplikovaná augmentácia a natrénovať ich.",
            "Diskusia o vlastnom riešení / implementácie siete namiesto použitia existujúcej.",
            "Reminder - výsledky úspešnosti nášho trénovania a úspešnosti konkurentých projektov spísať do jednej tabuľky pre lepšiu porovnateľnosť výsledkov a tabuľku zahrnúť do dokumentácie."
        ]
    },{
        "date":"15.03.2024", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Diskudia o pokroku v trénovaní - výskyt problémov pri augmentácii : množina problémov sa týkala priamo funkcionality, ktorá nebola navrhnutá pre nami vybraný dataset. Tieto problémy sa týkali kontrastu a jasnosti a vyriešil ich pôvodný tvorca daného súboru Marek Gálik. Druhá chyba sa týkala ukladania obrázkov cez numpy array, ktorá zachovávala takmer pôvodné farby obrázkov (normalizovali sa). Riešením načítania v správnom formáte sme vyriešili za pomoci knižnice pillow.",
            "Výsledok od posledného stretnutia je teda funkčná augmentácia s dostupným augmentovaným datasetom. Okrem iného sme výsledky úspešnosti porovnali s konkurenciou a výsledok je pri najlepšom približne 84% čo je takmer rovnaká úspešnosť na ako najlepšia dosiahnutá spomedzi príslušných projektov (pomocou Unet).",
            "Do najbližšieho stretnutia sa máme rozhodnúť akým smerom by sme chceli ešte pokračovať, potenciálne nápady:",
            "a) vytvoriť odlišnú štruktúru pomocou ResNet modelu",
            "b) jednoducho modifikovať štruktúru aktuálneho Unet modelu a porovnať výsledky s dosavadnými",
            "c) prejsť na trénovanie samotnej makuly",
            "Na záver priblžný plán do konca semestra - po hore uvedenej časti nám už zostane priestor čisto na dorobenie a finalizovanie dokumentácie a paralelne s tým vytvorenie výstižného a podstatného opisu projektu a všetko s ním spojeného an našu webovú stránku."
        ]
    },{
        "date":"22.03.2024", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Vyhodnotenie modelu celej makule a diskusia nad výsledkami. Dokopy sme vyhodnocovali úspešnosť šiestich modelov na piatich obrázkoch makúl. Najlepší model, trénovaný na neaugmentovanom testovacom datasete dosiahol dice skóre 0.82 a ten istý model dosiahol na makuliach dice skóre 0.747. Model trénovaný na augmentovanom testovacom datasete (celkovo najlepší) dosiahol dice skóre 0.845 a na makuliach dosiahol dice skóre 0.849.",
            "Naštudovanie a výber nových architektúr sietí, ktoré by sme navyše trénovali a vyhodnotili z dôvodu toho, aby sme mali viacero rôznych výsledkov priamo od nás na porovnanie (nerátame výsledky konkurentných projektov).",
            "Náš dosavadný postup a nové znalosti zdokumentovať do dokumentácie."
        ]
    },{
        "date":"29.03.2024", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Natrénovanie a vyhodnotenie modelu na neupravených originálnych snímkach (s časťami nervu a aj s bočnými časťami). Toto trénovanie dosiahlo na testovacom datasete dice skóre 0.598 a to vrátane vrstvy s nervom. Bez nervovej vrstvy dosiahol dice skóre 0.581. Na makuliach model dosiahol dice skóre 0.548 čo je značne horšie ako náš upravený augmentovaný dataset.",
            "Naštudovanie architektúry siete 'DeepLab V3+', ktorý je postavený aj na 'ResNet 50'. Snaha o implementáciu tejto architektúry pre náš problém. Implementácia sa nepodarila pre problém v danej sieti.",
            "Zhrnutie celkových výsledkov porovnaní našich úspešností, ale aj úspešností konkurentných projektov do jednej tabuľky, ktorá je zverejnená na web stránke projektu."
        ]
    },{
        "date":"05.04.2024", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Dopísanie dokumentácie projektu a posunutie zadávateľovi projektu na kontrolu.",
            "Optimalizácia funkcií z prediction_utils, teraz dokážu rátať napríklad dice skóre aj s možnosťou iného počtu vrstiev.",
            "Postupné dopĺňanie postupu práce a výsledkov z praktickej časti na webovú stránku projektu."
        ]
    },{
        "date":"26.04.2024", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Review opráv a pripomienok k dokumentácii projektu.",
            "   Odstrániť linky v zozname obrázkov",
            "   Zjednotenie anglickej a slovenskej skratky na slovenskú z dôvodu jej zriedkavého výskytu",
            "   Odstrániť zoznam algoritmov a výpisov, pretože tie nebolo potrebné pri našom projekte vytvárať",
            "   V úvode opraviť a skonštruovať výstižný dôvod našej práce",
            "   V praktickej časti dokumentácie doplniť na začiatok informácie o datasete Sanghai a to najmä čo sa týka našeho výberu snímok, zdroja odkiaľ dataset pochádza a tiež aké operácie sme nad snímkami museli vykonať",
            "   Dôležitá oprava citácie, rôznych malých chýb",
            "   Dopísať záver projektu, abstrakt nie je potrebný",
            "   Do prílohy pridať aj zdrojové kódy"
        ]
    }
]