[
    {
        "date":"05.10.2023", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description": [
            "Zoznámenie sa p. vedúcej projektu s členmi tímu, krátke predstavenie sa.",
            "Úvod do predmetu, objasnenie, že výstupom predmetu bude práca podobná bakalárskej práci, pričom rozsah sa rozdelí medzi členov tímu (cca 7-8 strán na člena). Počas TP1 bude cieľom zamerať sa na teoretickú časť práce.",
            "Teoretický úvod do problematiky OCT.",
            "Vysvetlenie zadania projektu - cieľom je segmentovať jednotlivé vrstvy retiny z obrazov, ktoré sú výstupom OCT vyšetrenia.",
            "Rozdelenie úloh do ďalšieho stretnutia (12. 10. o 13:00):",
            "3 členovia si viac naštudujú, ako možno získať relevantné obrazy na analýzy (datasety, …). (Gálik, Jenčík, Kopecký)",
            "2 členovia zistia viac o známych postupoch segmentácie informácii z obrazov, či už v oblasti blízkej projektu alebo inej. (Galčíková, Malíšek)",
            "Založenie komunikačného kanálu na platforme FB Messenger. (Galčíková)",
            "Založenie skupiny na platforme Trello pre efektívny manažment a sledovanie progresu práce. (Gálik)",
            "Určenie lídra (vedúceho) spomedzi členov tímu.",
            "Spísanie zápisnice z prvého stretnutia. (Malíšek)"
        ]
    },
    {
        "date":"12.10.2023", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Odprezentovanie výsledkov z úloh zadaných na predošlom stretnutí.",
            "Lídrom tímu je Miroslav Malíšek.",
            "Komunikačný kanál na platforme FB Messenger a skupina na platforme Trello boli úspešne vytvorené.",
            "Prezentácia dostupných databáz OCT snímkov sietnice. (Gálik, Jenčík, Kopecký)",
            "Prezentácia známych postupov segmentácie vrstiev sietnice z OCT snímkov. (Galčíková, Malíšek)",
            "Rozdelenie úloh do ďalšieho stretnutia:",
            "Spracovanie informácií o preskúmaných dostupných databázach OCT snímkov do tabuľky. (Gálik)",
            "Prieskum a otestovanie možností preprocessingu obrázkov sietnice. (Jenčík, Malíšek)",
            "Prieskum možností vyrezávania častí obrázkov s očným nervom. (Galčíková, Gálik, Kopecký)",
            "Spísanie zápisnice z druhého stretnutia. (Galčíková)"
        ]
    },
    {
        "date":"19.10.2023", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "V rámci tohto stretnutia Marek Gálik písomne informoval cez skupinu na FB Messenger p. vedúcu projektu a zvyšok tímu o tom, ako spracoval získané databázy OCT snímkov.",
            "Samotné datasety uložil na Google disk, ktorý je poskytnutý na univerzitnú licenciu STU.",
            "Štruktútu disku, datasetov a informácii o nich prehľadne zobrazil do tabuľky v exceli.",
            "Okrem toho Marek Gálik a Tomáš Jenčík informovali, že sa v datasete Waterloo pokúsili spárovať obrazy OCT so segmentovanými maskami, avšak presnosť sa ukázala ako veľmi nízka a masky na obrazy nesedeli.",
            "Ostatní členovia tímu počas tohto týždňa pracovali na splnení úloh, ktoré im boli zadané na 2. stretnutí."
        ]
    },
    {
        "date":"26.10.2023", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Odprezentovanie výsledkov z úloh zadaných na 2. stretnutí.",
            "Prezentácia možných postupov číslicového spracovania OCT obrazov sietnice a tiež použitie jednoduchých algoritmov strojového učenia na segmentáciu vrstiev sietnice z obrazov. (Malíšek)",
            "Prezentácia o možnom postupe predspracovania OCT obrazov sietnice, v ktorých sa nachádza očný nerv. (Galčíková)",
            "Rozdelenie úloh do ďalšieho týždňa. (deadline 1.11. 2022 o 20:00)",
            "Teória k hlbokým neurónovým sieťam, ktoré sa používajú na segmentáciu obrazov. (Galčíková)",
            "Teória a rozbor konkrétnych neurónových sietí, ktoré sa už použili pri segmentácii OCT obrazov sietnice oka v iných publikáciách. (Gálik)",
            "Popis OCT prístroja a jeho výstupov. Teoretický úvod do problému segmentácie. (Jenčík)",
            "Sietnica oka. Makula. Popis OCT obrazu makuly. Ochorenia, ktoré sa diagnostikujú pomocou OCT makuly (Kopecký).",
            "Teória k číslicovým spracovaniam obrazov. Popis základných algoritmov strojového učenia, ktoré sa používajú na segmentáciu obrazov. (Malíšek)",
            "Dohodnutie ďalšieho stretnutia na 3.11. 2023 o 10:00.",
            "Spísanie zápisnice zo 4. stretnutia. (Malíšek)"
        ]
    },
    {
        "date":"03.11.2023", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Vytvorený web projektu cez GitHub pages. (Kopecký)",
            "Kontrola teoretických dokumentácií, konzulovanie chýb a nedostatkov.",
            "Úloha na nasledujúci týždeň - poopravovať dokumenty a pospájať ich do jedného celku a vytvoriť finálnu teóriu do dokumentácie. (deadline 8.11.2023)",
            "Doplňujúca úloha - teória o metrikách. (Jenčík)",
            "Do budúceho stretnutia sa spoločne dohodnúť akú metódu použijeme pri segmentácií a čo ideme skúmať.",
            "Naplánovanie ďalšieho stretnutia na piatok 10.11. o 10:00.",
            "Spísanie zápisnice z 5. stretnutia. (Kopecký)"
        ]
    },
    {
        "date":"10.11.2023", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Kontrola spojeného dokumentu písaného v LaTeXe, preorganizovanie poradia obsahu:",
            "1. Sietnica oka a makula",
            "2. OCT prístroj",
            "3. Čo je to segmentácia",
            "4. Segmentácia obrazov pomocou hlbokých sietí",
            "5. Metriky používané pri segmentácií obrazov",
            "6. Ďalšie prístupy segmentácie obrazov",
            "7. Segmentácia pomocou číslicového spracovania obrazov",
            "Popísať metódy segmentácie obrazových dát.",
            "Pridať základný úvod o sieťach.",
            "Vytvoriť samostatnú kapitolu pre existujúcich projektoch v praxi - týkajúc sa segmentácie a jej výsledkov.",
            "MGU-Net model a Pokročilé U-Net modely premenovať tak ako to správne nazývajú v článkoch, z ktorých sme čerpali.",
            "Spomenuté časti zaobaliť a označiť ako analytickú časť práce.",
            "Úloha je naplánovať si zasadnutie skupiny, na ktorom dohodneme metódu a dataset, ktorý použijeme na praktickej časti práce.",
            "Úlohy do budúceho týždňa:",
            "a) Upratať databázu a dohodnúť sa čo použijeme, pokúsiť sa vyriešiť problém s maskami.",
            "b) Prerobiť štruktúru dokumentu podľa dohodnutých podmienok."
        ]
    },
    {
        "date":"17.11.2023", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Odprezentovanie upraveného dokumentu pre teoretickú časť a popis datasetov.",
            "Prezentácia spojenej teórie v jednom celku. (Jenčík)",
            "Prezentácia výsledkov pre hľadanie nových datasetov a získaných informácií k už získaným datasetom. (Gálik, Galčíková, Kopecký)",
            "Rozdelenie úloh do ďalšieho týždňa (deadline 23.11. 2023).",
            "Úpravy teoretickej časti. (Jenčík)",
            "Pokračovanie v hľadaní nových datasetov pre segmentované obrázky sietnice oka. (Galčíková, Gálik, Kopecký)",
            "Pokračovanie v hľadaní iných spôsobov pre spracovanie obrazu sietnice oka. (Malíšek)",
            "Spísanie zápisnice zo 7. stretnutia. (Jenčík)"
        ]
    },
    {
        "date":"23.11.2023", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Riešenie problémov s konkrétnymi datasetmi a hľadanie riešení.",
            "Popis nájdených problémov.",
            "Opis datasetu Waterloo.",
            "Opis datasetu Sanghai.",
            "Popis riešenia vyrezania fovey.",
            "Hľadanie možností pre natrénovanie siete.",
            "Naplánovanie ďalšieho stretnutia na 30.11.2023.",
            "Rozdelenie úloh do ďalšieho týždňa (deadline 30.11. 2023):",
            "1. Odstránenie terčov a príprava databázy",
            "2. Príprava a natrénovanie siete",
            "3. Príprava MGU netu",
            "4. Príprava programu",
            "5. Komunikácia s vlastníkmi datasetu Waterloo",
            "Rozdelenie foveoly na 2 polovice pre testovaciu databázu (úloha do budúcna)."
        ]
    },
    {
        "date":"30.11.2023", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Prezentácia programu, ukážka obrázkov bez terčov a diagnostika nájdených problémov.",
            "Konzultovanie spôsobu, akým by sme mohli vyriešiť odstránenie čiernej plochy z obrázkov tak, aby pri vyhodnocovaní nepridávalo úspešnosť predpovede do tejto plochy.",
            "Rozdelenie úloh jednotlivcom tímu:",
            "1. Na stránku napísať o databázacha čo s nimi robíme (čo sa v kóde robilo s obrázkami), pridať sekciu na stránku o riešiteľoch, popísať OCT na základe už spísanej teórie v dokumentácií. (Kopecký)",
            "2. Vrstvová úspešnosť - vyriešiť problém s čiernymi oblasťami a predpovedaním sa do tejto oblasti. (Malíšek)",
            "3. Implementovať augmentáciu + tuning trénovania. (Galčíková)",
            "4. Preložiť semi-transparentné masky cez pôvodné obrázky pre lepšie pochopenie výsledkov počas testovania - budeme môcť kontrolovať ako veľmi sme sa trafili pri rozdelení jednotlivých vrstiev. (Gálik)",
            "5. Úprava dokumentácie (popísať čo sme robili v kóde a aký je výsledok). (Jenčík)",
            "Naplánovanie budúceho meetingu na 07.12.2023 vo štvrtok prezenčne."
        ]
    },
    {
        "date":"07.12.2023", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Prezentovanie vrstvovej úspešnosti - úloha dotrénovať a otestovať výsledky na základe predikovaných masiek.",
            "Prezentovanie výsledok preložených semi-transparentných masiek",
            "Konzultovanie ohľadom dokumentácie pokroku pri trénovaní",
            "Prezentácia webstránky - úloha doplniť opis trénovania a implementovaného kódu + pridať reprezentatívne obrázky výsledkov",
            "Naplánovanie budúceho stretnutia online vo štvrtok 14.12.2023"
        ]
    },
    {
        "date":"14.12.2023", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Prezentácia úspešnosti náhodných trénovaní.",
            "Na základe slabej predikcie poslednej vrstvy zdola oproti pravdivej maske porozmýšlať nad metódou predspracovania pre túto vrstvu - môže nám to veľmi zlepšiť úspešnosť, pretože je to najväčšia vrstva.",
            "Prezentovanie augmentácie + zapojiť do budúcna augmentáciu pri trénovaní a porovnať výsledky.",
            "Diskusia - zistenie chyby na maskách niekoľkých obrázkov : rozhodnúť sa ako ďalej s týmito obrázkami pracovať, pravdepodobne odstránime/odrežeme na obrázku aj maske rovnakú oblasť, v ktorej sa nachádza zakryvená vrstva, pretože na pravdivej maske ju vôbec nevidno a následne tieto orezané obrázky znova natrénovať.",
            "Komunikovanie ohľadom odovzdávania práce a obsahu, ktorý má dokumentácia obsahovať - do 14.01.2023 poslať MUDr. Kurilovej prácu na kontrolu vo formáte docx."
        ]
    }
]