[
    {
        "date":"05.10.2023", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description": [
            "Zoznámenie sa p. vedúcej projektu s členmi tímu, krátke predstavenie sa.",
            "Úvod do predmetu, objasnenie, že výstupom predmetu bude práca podobná bakalárskej práci, pričom rozsah sa rozdelí medzi členov tímu (cca 7-8 strán na člena). Počas TP1 bude cieľom zamerať sa na teoretickú časť práce.",
            "Teoretický úvod do problematiky OCT.",
            "Vysvetlenie zadania projektu - cieľom je segmentovať jednotlivé vrstvy retiny z obrazov, ktoré sú výstupom OCT vyšetrenia.",
            "Rozdelenie úloh do ďalšieho stretnutia (12. 10. o 13:00):",
            "3 členovia si viac naštudujú, ako možno získať relevantné obrazy na analýzy (datasety, …). (Gálik, Jenčík, Kopecký)",
            "2 členovia zistia viac o známych postupoch segmentácie informácii z obrazov, či už v oblasti blízkej projektu alebo inej. (Galčíková, Malíšek)",
            "Založenie komunikačného kanálu na platforme FB Messenger. (Galčíková)",
            "Založenie skupiny na platforme Trello pre efektívny manažment a sledovanie progresu práce. (Gálik)",
            "Určenie lídra (vedúceho) spomedzi členov tímu.",
            "Spísanie zápisnice z prvého stretnutia. (Malíšek)"
        ]
    },
    {
        "date":"12.10.2023", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Odprezentovanie výsledkov z úloh zadaných na predošlom stretnutí.",
            "Lídrom tímu je Miroslav Malíšek.",
            "Komunikačný kanál na platforme FB Messenger a skupina na platforme Trello boli úspešne vytvorené.",
            "Prezentácia dostupných databáz OCT snímkov sietnice. (Gálik, Jenčík, Kopecký)",
            "Prezentácia známych postupov segmentácie vrstiev sietnice z OCT snímkov. (Galčíková, Malíšek)",
            "Rozdelenie úloh do ďalšieho stretnutia:",
            "Spracovanie informácií o preskúmaných dostupných databázach OCT snímkov do tabuľky. (Gálik)",
            "Prieskum a otestovanie možností preprocessingu obrázkov sietnice. (Jenčík, Malíšek)",
            "Prieskum možností vyrezávania častí obrázkov s očným nervom. (Galčíková, Gálik, Kopecký)",
            "Spísanie zápisnice z druhého stretnutia. (Galčíková)"
        ]
    },
    {
        "date":"19.10.2023", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "V rámci tohto stretnutia Marek Gálik písomne informoval cez skupinu na FB Messenger p. vedúcu projektu a zvyšok tímu o tom, ako spracoval získané databázy OCT snímkov.",
            "Samotné datasety uložil na Google disk, ktorý je poskytnutý na univerzitnú licenciu STU.",
            "Štruktútu disku, datasetov a informácii o nich prehľadne zobrazil do tabuľky v exceli.",
            "Okrem toho Marek Gálik a Tomáš Jenčík informovali, že sa v datasete Waterloo pokúsili spárovať obrazy OCT so segmentovanými maskami, avšak presnosť sa ukázala ako veľmi nízka a masky na obrazy nesedeli.",
            "Ostatní členovia tímu počas tohto týždňa pracovali na splnení úloh, ktoré im boli zadané na 2. stretnutí."
        ]
    },
    {
        "date":"26.10.2023", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Odprezentovanie výsledkov z úloh zadaných na 2. stretnutí.",
            "Prezentácia možných postupov číslicového spracovania OCT obrazov sietnice a tiež použitie jednoduchých algoritmov strojového učenia na segmentáciu vrstiev sietnice z obrazov. (Malíšek)",
            "Prezentácia o možnom postupe predspracovania OCT obrazov sietnice, v ktorých sa nachádza očný nerv. (Galčíková)",
            "Rozdelenie úloh do ďalšieho týždňa. (deadline 1.11. 2022 o 20:00)",
            "Teória k hlbokým neurónovým sieťam, ktoré sa používajú na segmentáciu obrazov. (Galčíková)",
            "Teória a rozbor konkrétnych neurónových sietí, ktoré sa už použili pri segmentácii OCT obrazov sietnice oka v iných publikáciách. (Gálik)",
            "Popis OCT prístroja a jeho výstupov. Teoretický úvod do problému segmentácie. (Jenčík)",
            "Sietnica oka. Makula. Popis OCT obrazu makuly. Ochorenia, ktoré sa diagnostikujú pomocou OCT makuly (Kopecký).",
            "Teória k číslicovým spracovaniam obrazov. Popis základných algoritmov strojového učenia, ktoré sa používajú na segmentáciu obrazov. (Malíšek)",
            "Dohodnutie ďalšieho stretnutia na 3.11. 2023 o 10:00.",
            "Spísanie zápisnice zo 4. stretnutia. (Malíšek)"
        ]
    },
    {
        "date":"03.11.2023", 
        "participation":["prítomná", "prítomná", "prítomný", "prítomný", "prítomný", "prítomný"], 
        "description":[
            "Vytvorený web projektu cez GitHub pages. (Kopecký)",
            "Kontrola teoretických dokumentácií, konzulovanie chýb a nedostatkov.",
            "Úloha na nasledujúci týždeň - poopravovať dokumenty a pospájať ich do jedného celku a vytvoriť finálnu teóriu do dokumentácie. (deadline 8.11.2023)",
            "Doplňujúca úloha - teória o metrikách. (Jenčík)",
            "Do budúceho stretnutia sa spoločne dohodnúť akú metódu použijeme pri segmentácií a čo ideme skúmať.",
            "Naplánovanie ďalšieho stretnutia na piatok 10.11. o 10:00.",
            "Spísanie zápisnice z 5. stretnutia. (Kopecký)"
        ]
    }
]